<?php

return [

    'msg' => [
        1 => '操作成功',
        -1 => '操作失败',
        -2 => '验证错误',
        -1000 => '账号不存在',
        -1001 => '密码错误',
        -1002 => '账号状态异常',
        -1003 => '注册失败',
        -1004 => '账号已存在',
    ]
//    'code' => [
//        'SUCCESS_OK' => 1, //成功
//        'ERROR' => -1, //错误
//        'ERROR_VALIDATE' => -2, //验证错误
//        'ERROR_USER_NO' => -1000, //用户不存在
//        'ERROR_USER_PASW' => -1001, //密码错误
//        'ERROR_USER_STATUS' => -1002, //状态不正确
//        'ERROR_USER_REG' => -1003, //注册失败
//        'ERROR_USER_REG_EXIST' => -1004, //用户名已存在
//    ],
];
